{
    "val-general-version": "This number is used for internal processing of a validation file. It does NOT specify whether this is a modified copy of the original validation file.",
    "val-general-currenttime": "The date and time of the starting of the transfer described in this validation file.",

    "val-file-size": "The size of the file that has been transferred (at the time of sending)",
    "val-file-path": "The location of the transferred file (at the time of sending)",
    "val-file-name": "The full name of the transferred file (at the time of sending)",
    "val-file-lastmodified": "When the transferred file was last modified (before the time of sending)",
    "val-file-license": "The license under which the transferred file may be used by the receiving party",
    "val-file-description": "A description of the contents of the file that has been transferred, inputted by the sending party at the time of sending",
    "val-file-hash": "The keccak256 hash of the full file that has been transferred (at the time of sending)",

    "val-sender-name": "The name of the person who sent the file",
    "val-sender-assemblid": "The Assembl ID of the sender",
    "val-sender-orcidid": "The ORCID iD of the sender",

    "val-receiver-name": "The name of the person who received the file",
    "val-receiver-assemblid": "The Assembl ID of the receiver",
    "val-receiver-orcidid": "The ORCID iD of the receiver",


    "ver-general-version": "This number is used for internal processing of a verification file. It does NOT specify whether this is a modified copy of the original verification file.",
    "ver-general-currenttime": "The date and time of the starting of the transfer described in this validation file.",
    
    "ver-validation-path": "The location of the validation file in question (when the hash was added to the blockchain).",
    "ver-validation-name": "The name of the validation file in question (when the hash was added to the blockchain).",
    "ver-validation-hash": "The keccak256 hash of the full validation file in question (when the hash was added to the blockchain).",

    "ver-stellar-transactionid": "The transaction ID of the transaction on the Stellar blockchain. Visit the Stellar Explorer at https://steexp.org/ to view the transaction details belonging to this ID.",
    "ver-stellar-time": "The time of when the Stellar transaction was completed.",
    "ver-stellar-ledger": "The ID of the ledger that performed the transaction (according to Stellar)."
}